; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image4 - mode
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation1 - direction
	Star6 - direction
	Star4 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation2 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 thermograph0)
	(supports instrument1 image4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 image1)
	(supports instrument2 image4)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
)
(:goal (and
	(pointing satellite2 Star8)
	(have_image Star7 thermograph0)
	(have_image Star8 thermograph2)
	(have_image Star9 thermograph3)
	(have_image Planet10 image4)
	(have_image Planet11 image4)
))

)

; plan
1. (turn_to satellite2 groundstation3 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite2 planet10 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet10)
   goals met: 0 of 6
5. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
6. (take_image satellite2 planet10 instrument2 image4)
   added: (have_image planet10 image4)
   goals met: 1 of 6
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (turn_to satellite1 planet11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet11)
   goals met: 1 of 6
10. (take_image satellite1 planet11 instrument1 image4)
   added: (have_image planet11 image4)
   goals met: 2 of 6
11. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 2 of 6
12. (take_image satellite1 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 3 of 6
13. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 3 of 6
14. (take_image satellite1 star8 instrument1 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 4 of 6
15. (turn_to satellite2 star9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star9)
   goals met: 4 of 6
16. (take_image satellite2 star9 instrument2 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 5 of 6
17. (turn_to satellite2 star8 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star8)
   goals met: 6 of 6
